
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/Akihiro1001/aws-ecs-terraform/actions/runs/5035268272)



<pre><code>Apply complete! Resources: 4 added, 2 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-056fe42137121ab23]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0320ac62caeaa7389]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0f0dd577b6a580cb7]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0863081fb8ee5dc4b]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d213fca1fe5e63ac]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0055e2096efcdf432]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b7620782af7fcfdc]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-03f34da35d1513cc6]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-04b35dbc37682e7c6]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0ee05e5fe37c19eb6]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0239dae77dd06e08b]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0777319f9135b1951]
aws_security_group.ecs: Refreshing state... [id=sg-0d9c9b456395c778a]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-053e7113956f941a5]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-05f8d8de411c15369]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:115748871192:targetgroup/go-simple-server-target-group/26c097ce080cf4b2]
aws_security_group.alb: Refreshing state... [id=sg-0d1fb1e79c58dc2bc]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0777319f9135b19511080289494]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-01404b9acf6c213fc]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-079b4d08769220b42]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0fcd1681f1faef93a]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-000163a37cac9c907]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-067b3f66f6492f0af]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-03ab0044aef7d9e99]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:115748871192:loadbalancer/app/go-simple-server-alb/65017f648e3d1160]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-3601755104]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-04b35dbc37682e7c61080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0ee05e5fe37c19eb61080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:115748871192:listener/app/go-simple-server-alb/65017f648e3d1160/1c5f45c3b9982687]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:115748871192:listener-rule/app/go-simple-server-alb/65017f648e3d1160/1c5f45c3b9982687/704b43ac89b14866]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.ecr_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "ecr_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 30
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "go-simple-server"
    }

  # aws_ecr_repository.ecr_repository will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "go-simple-server"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = "eipalloc-0f0dd577b6a580cb7"
      + association_id       = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = "subnet-03f34da35d1513cc6"
      + tags                 = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1a"
        }
      + tags_all             = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1a"
        }
    }

  # module.vpc.aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = "eipalloc-056fe42137121ab23"
      + association_id       = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = "subnet-05f8d8de411c15369"
      + tags                 = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1c"
        }
      + tags_all             = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1c"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be updated in-place
  ~ resource "aws_route" "private_nat_gateway" {
        id                     = "r-rtb-04b35dbc37682e7c61080289494"
      ~ nat_gateway_id         = "nat-000163a37cac9c907" -> (known after apply)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be updated in-place
  ~ resource "aws_route" "private_nat_gateway" {
        id                     = "r-rtb-0ee05e5fe37c19eb61080289494"
      ~ nat_gateway_id         = "nat-067b3f66f6492f0af" -> (known after apply)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 2 to change, 0 to destroy.
aws_ecr_repository.ecr_repository: Creating...
module.vpc.aws_nat_gateway.this[0]: Creating...
module.vpc.aws_nat_gateway.this[1]: Creating...
aws_ecr_repository.ecr_repository: Creation complete after 1s [id=go-simple-server]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creating...
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creation complete after 1s [id=go-simple-server]
module.vpc.aws_nat_gateway.this[1]: Still creating... [10s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [10s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [20s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [20s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [30s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [30s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [40s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [40s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [50s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [50s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m0s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m0s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m10s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m10s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m20s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m20s elapsed]
module.vpc.aws_nat_gateway.this[0]: Creation complete after 1m27s [id=nat-01915e3b3d0684c2c]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m30s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m40s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m50s elapsed]
module.vpc.aws_nat_gateway.this[1]: Creation complete after 1m58s [id=nat-077b629d7119a77e3]
module.vpc.aws_route.private_nat_gateway[0]: Modifying... [id=r-rtb-04b35dbc37682e7c61080289494]
module.vpc.aws_route.private_nat_gateway[1]: Modifying... [id=r-rtb-0ee05e5fe37c19eb61080289494]
module.vpc.aws_route.private_nat_gateway[0]: Modifications complete after 1s [id=r-rtb-04b35dbc37682e7c61080289494]
module.vpc.aws_route.private_nat_gateway[1]: Modifications complete after 1s [id=r-rtb-0ee05e5fe37c19eb61080289494]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 4 added, 2 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":5,"Program":"tfcmt","SHA1":"2a2a556e73bf9206f0fdfc0b0b1bd707e6043e19","Vars":{},"WorkflowName":"Terraform"} -->